Revit 2026 API

# MEPSectionTotalCurveLength Property

---

The total length of all segments in the section.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TotalCurveLength { get; }
```
```vb
Public ReadOnly Property TotalCurveLength As Double
	Get
```
```cpp
public:
property double TotalCurveLength {
	double get ();
}
```
```fsharp
member TotalCurveLength : float with get
```

#### Property Value

Double

Default unit is Decimal feet. The unit type is UT_Length.

#### Reference

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace